Revit 2027 API
DividedPath.IsValidSpacingRuleLayout Method
 Checks that the spacing rule layout enumeration value is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSpacingRuleLayout(
	SpacingRuleLayout layout
)
Public Function IsValidSpacingRuleLayout (
	layout As SpacingRuleLayout
) As Boolean
public:
bool IsValidSpacingRuleLayout(
	SpacingRuleLayout layout
)
member IsValidSpacingRuleLayout :
        layout : SpacingRuleLayout -> bool
Parameters
layout SpacingRuleLayout
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace